tylertms/dspic33e-sim/tests/device/dspic33ep_mu/timing/rtcc_test.c
static void lifecycle_cases(TestState* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize RTCC copy");
    if (!initialized) {
        return;
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    set_alarm(cpu, 0x5678u, 0x0311u, 0x0912u);
    cpu->io.rtcc.prescaler = 123u;
    cpu->io.rtcc.alarm_output = true;
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x91a5u);
    expect(state, dspic33_rtcc_clock(cpu, 10u, 2u), "schedule RTCC edges before copy");
    expect(state, dspic33_copy(&copy, cpu), "copy pending RTCC state");
    expect(state, dspic33_device_advance(cpu, 2u) && dspic33_device_advance(&copy, 2u),
           "advance original and copied RTCC");
    expect(state,
           memcmp(&copy.io.rtcc, &cpu->io.rtcc, sizeof(cpu->io.rtcc)) == 0 &&
               dspic33_read_word(&copy, RTCC_CONTROL) == dspic33_read_word(cpu, RTCC_CONTROL),
           "copy preserves RTCC runtime and registers");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    set_alarm(cpu, 0x5678u, 0x0311u, 0x0912u);
    cpu->io.rtcc.prescaler = 123u;
    cpu->io.rtcc.alarm_output = true;
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, 0x91a5u);
    dspic33_load_program_word(cpu, 0u, 0xfe0000u);
    cpu->pc = 0u;
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "execute warm reset with RTCC");
    expect(state,
           cpu->io.rtcc.calendar[0] == 0x1234u && cpu->io.rtcc.calendar[3] == 0x0026u &&
               cpu->io.rtcc.prescaler == 123u,
           "warm reset preserves calendar and prescaler");
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == (RTCC_ENABLE | RTCC_WRITE_ENABLE),
           "warm reset preserves RCFGCAL");
    expect(state, dspic33_read_word(cpu, RTCC_ALARM_CONTROL) == 0x91a5u,
           "warm reset preserves alarm control");
    expect(state,
           cpu->io.rtcc.alarm[0] == 0x5678u && cpu->io.rtcc.alarm[2] == 0x0912u &&
               cpu->io.rtcc.alarm_output && !cpu->io.rtcc.pmd_disabled &&
               cpu->io.rtcc.pmd_generation == 0u,
           "warm reset preserves alarm state and resets PMD state");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x1234u, 0x0212u, 0x0810u, 0x0026u);
    expect(state, dspic33_rtcc_clock(cpu, 100u, 5u), "schedule RTCC edges before POR");
    dspic33_reset(cpu, 0u);
    expect(state, cpu->events.count == 0u && cpu->io.rtcc.prescaler == 0u,
           "POR cancels RTCC event and clears prescaler");
    expect(state, cpu->io.rtcc.calendar[0] == 0u && cpu->io.rtcc.calendar[3] == 0u,
           "POR clears deterministic calendar state");
    expect(state, dspic33_device_advance(cpu, 5u), "advance after RTCC POR");
    expect(state, cpu->io.rtcc.prescaler == 0u, "stale RTCC event cannot advance after POR");

    dspic33_reset(cpu, 0u);
    cpu->device_cycles = UINT64_MAX;
    expect(state, !dspic33_rtcc_clock(cpu, 1u, 1u), "RTCC edge scheduling reports overflow");
    expect(state, cpu->events.count == 0u && cpu->io.rtcc.prescaler == 0u,
           "failed RTCC edge schedule leaves state unchanged");
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    expect(state,
           (dspic33_read_word(cpu, RTCC_PMD_ADDRESS) & RTCC_PMD) == 0u &&
               cpu->io.rtcc.pmd_generation == 2u,
           "failed RTCC PMD transition rolls back and invalidates generation");
    expect(state,
           !cpu->io.rtcc.pmd_disabled && cpu->events.count == 0u &&
               cpu->stop_reason == DSPIC33_EVENT_QUEUE_ERROR,
           "failed RTCC PMD transition preserves effective state");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, 0u);
    expect(state, cpu->io.rtcc.pmd_generation == 2u && cpu->events.count == 2u,
           "rapid RTCC PMD toggle queues generations");
    expect(state,
           dspic33_device_advance(cpu, 1u) && !cpu->io.rtcc.pmd_disabled && cpu->events.count == 0u,
           "stale RTCC PMD event cannot override latest state");
    dspic33_release(&copy);
}

static void long_sequence_cases(TestState* state, Dspic33* cpu) {
    uint8_t elapsed;
    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    for (elapsed = 1u; elapsed <= 85u; elapsed++) {
        uint8_t expected_second = (uint8_t)(elapsed % 60u);
        uint8_t expected_minute = (uint8_t)(elapsed / 60u);
        expect(state, clock_edges(cpu, 32768u), "advance RTCC long sequence second");
        expect(state,
               cpu->io.rtcc.calendar[0] ==
                   (uint16_t)(((expected_minute / 10u * 16u + expected_minute % 10u) << 8u) |
                              (expected_second / 10u * 16u + expected_second % 10u)),
               "RTCC long sequence calendar value");
    }
}

int main(void) {
    Dspic33 cpu;
    TestState state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize RTCC processor");
    if (initialized) {
        reset_access_cases(&state, &cpu);
        authorization_cases(&state, &cpu);
        pointer_read_cases(&state, &cpu);
        pointer_write_cases(&state, &cpu);
        transfer_context_cases(&state, &cpu);
        calendar_cases(&state, &cpu);
        calibration_cases(&state, &cpu);
        alarm_cases(&state, &cpu);
        interrupt_output_power_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        long_sequence_cases(&state, &cpu);
        dspic33_release(&cpu);
    }
    return test_finish(&state);
}
